In [10]:
# downloading the data from R to local path with the folowing R script:
# df = airquality
# write.csv(df,"C:/Users/adishree.b/Documents/airquality.csv")

In [24]:
# Importing the dataset from the folder as a pandas dataframe
import pandas as pd
df = pd.read_csv('C:/Users/adishree.b/Documents/airquality.csv')

In [25]:
df.shape

(153, 7)

In [26]:
df.head(2)

   Unnamed: 0  Ozone  Solar.R  Wind  Temp  Month  Day
0           1   41.0    190.0   7.4    67      5    1
1           2   36.0    118.0   8.0    72      5    2

In [27]:
df.columns

Index(['Unnamed: 0', 'Ozone', 'Solar.R', 'Wind', 'Temp', 'Month', 'Day'], dtype='object')

In [28]:
df.drop(['Unnamed: 0'], axis = 1, inplace = True)

In [29]:
df.head(2)

   Ozone  Solar.R  Wind  Temp  Month  Day
0   41.0    190.0   7.4    67      5    1
1   36.0    118.0   8.0    72      5    2

# 1. Create a new dataframe that contains all the values of the original dataframe but with no missing values. How many rows does this dataframe contain?

In [30]:
# Checking the missing values in the dataframe:
df.isnull().sum()

Ozone      37
Solar.R     7
Wind        0
Temp        0
Month       0
Day         0
dtype: int64

In [31]:
# creating a new dataframe without the missing values
df_q1 = df.dropna()

In [32]:
df1.isnull().sum()

Ozone      0
Solar.R    0
Wind       0
Temp       0
Month      0
Day        0
dtype: int64

In [117]:
df1.shape

(111, 6)

In [118]:
# The resulting dataframe has 111 columns

# 2. Create a subset of the original dataframe that contains only Ozone levels less than 31 and Temperature more than 70. How many rows of this subset dataframe?

In [37]:
# Creating a new dataframe from the original one with the conditions mentioned in the question:
df_q2 = df[(df['Ozone'] < 31) & (df['Temp'] > 70)]

In [39]:
df_q2.head(2)

    Ozone  Solar.R  Wind  Temp  Month  Day
2    12.0    149.0  12.6    74      5    3
10    7.0      NaN   6.9    74      5   11

In [40]:
df_q2.shape

(33, 6)

In [ ]:
# The resulting dataframe has 33 rows.

# 3. Create a new dataframe that contains only the columns, Solar.R, Temp, and Month and arrange its rows by the temperature value in a decreasing order. Which month is in the first rows of this dataframe?

In [43]:
# creating another dataframe as asked by the question and arranging it in the descending order.
df_q3 = df[['Solar.R','Temp','Month']].sort_values('Temp', ascending = False)

In [45]:
df_q3.head(3)

     Solar.R  Temp  Month
119    203.0    97      8
121    237.0    96      8
122    188.0    94      8

In [46]:
# August (Month 8) is in the first row of this dataframe

# 4. Which month has the highest mean temperature? Which month has the highest mean Solar radiation? Are these two months the same month?

In [72]:
# Grouping the temperature by month, taking their mean, and sorting the result in descending order:
df.groupby('Month')['Temp'].mean().sort_values(ascending = False)

Month
8    83.967742
7    83.903226
6    79.100000
9    76.900000
5    65.548387
Name: Temp, dtype: float64

In [76]:
# August (Month 8) has the highest mean temperature of 83.97

In [75]:
# Performing same procedure as above, for solar radiation this time.
df.groupby('Month')['Solar.R'].mean().sort_values(ascending = False)

Month
7    216.483871
6    190.166667
5    181.296296
8    171.857143
9    167.433333
Name: Solar.R, dtype: float64

In [77]:
# July (Month 7) has the highest mean solar radiation of 216.48

# 5. All these airquality measurements were taken in the year 1973. Which weekday has the highest mean temperature?

In [79]:
#  (Hint: create a new variable “date” with the day, month, and year=1973 then pull the name of the weekday from this variable)

In [108]:
# creating date column with 1973 as year and concatenating with month and day column:

df['date'] = '1973-' + df['Month'].map(str) + '-' + df['Day'].map(str)

In [109]:
# the resulting date column is a date like column, but is of the string type, as seen below:

df['date'].head(2)

0    1973-5-1
1    1973-5-2
Name: date, dtype: object

In [110]:
# converting the date column from string to datetime:

df['date'] = pd.to_datetime(df['date'])

In [113]:
print(df['date'].dtype)

datetime64[ns]

In [114]:
# creating a column weekday from the date column
df['weekday'] = df['date'].dt.dayofweek

In [115]:
# grouping the temperature by weekdays, finding their mean and sorting the resul in descending order:
df.groupby('weekday')['Temp'].mean().sort_values(ascending = False)

weekday
1    79.136364
3    78.590909
0    77.904762
5    77.636364
6    77.500000
2    77.227273
4    77.181818
Name: Temp, dtype: float64

In [116]:
# the 1st day of the week has the highest mean temperature of 79.13